In [3]:
import pandas as pd

In [4]:
pd.__version__

'0.25.2'

In [5]:
ser = pd.Series(['张三','李四','王五'])

In [6]:
ser

0    张三
1    李四
2    王五
dtype: object

In [7]:
list(range(1,4))

[1, 2, 3]

In [8]:
ser = pd.Series(['张三','李四','王五'], index = list(range(1,4)))

In [9]:
ser

1    张三
2    李四
3    王五
dtype: object

In [10]:
ser[2]

'李四'

In [11]:
ser[1]

'张三'

In [13]:
ser[2] = 'haha'

In [14]:
ser

1      张三
2    haha
3      王五
dtype: object

In [15]:
ser[2] = '李四'

In [16]:
ser

1    张三
2    李四
3    王五
dtype: object

In [18]:
ser[1]

'张三'

In [19]:
ser2 = pd.Series([18,17,19], index = range(1,4))

In [20]:
ser2

1    18
2    17
3    19
dtype: int64

In [21]:
ser2 + 1

1    19
2    18
3    20
dtype: int64

In [27]:
data = {
    'beijing': 9999,
    'shanghai': 8888,
    'guangzhou': 7777
}

In [28]:
data

{'beijing': 9999, 'shanghai': 8888, 'guangzhou': 7777}

In [29]:
ser3 = pd.Series(data)

In [30]:
ser3

beijing      9999
shanghai     8888
guangzhou    7777
dtype: int64

In [31]:
'beijing' in ser3

True

In [33]:
ser3.to_dict()

{'beijing': 9999, 'shanghai': 8888, 'guangzhou': 7777}

In [35]:
ser3.tolist()

[9999, 8888, 7777]

In [36]:
ser3.to_json()

'{"beijing":9999,"shanghai":8888,"guangzhou":7777}'

In [37]:
ser3.to_frame()

              0
beijing    9999
shanghai   8888
guangzhou  7777

## DataFrame

In [38]:
import numpy as np

In [42]:
data = np.arange(1,10).reshape(3,-1)

In [43]:
data

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [44]:
df = pd.DataFrame(data)

In [45]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [47]:
data = {
    'name':['happy','cyr','new'],
    'age':[17,18,19],
    'height':[1.72,1.82,1.65]
}

In [50]:
df = pd.DataFrame(data)

In [51]:
df

    name  age  height
0  happy   17    1.72
1    cyr   18    1.82
2    new   19    1.65

In [55]:
df.columns

Index(['name', 'age', 'height'], dtype='object')

In [57]:
df.columns[0]

'name'

In [59]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [61]:
df = pd.DataFrame(data,columns = ['name','age','height','email'],index = range(1,4))

In [62]:
df

    name  age  height email
1  happy   17    1.72   NaN
2    cyr   18    1.82   NaN
3    new   19    1.65   NaN

## pandas数据选取操作

In [63]:
data = {
    'name':['张三','李四','王五'],
    'age':[17,18,19],
    'height':[1.72,1.82,1.65]
}

In [64]:
data

{'name': ['张三', '李四', '王五'], 'age': [17, 18, 19], 'height': [1.72, 1.82, 1.65]}

In [66]:
df = pd.DataFrame(data)

In [67]:
df

  name  age  height
0   张三   17    1.72
1   李四   18    1.82
2   王五   19    1.65

In [68]:
df.name

0    张三
1    李四
2    王五
Name: name, dtype: object

In [69]:
df.name[1]

'李四'

In [70]:
df.name[1] = '赵六'

c:\users\god\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [71]:
df

  name  age  height
0   张三   17    1.72
1   赵六   18    1.82
2   王五   19    1.65

In [73]:
df[['name']]

  name
0   张三
1   赵六
2   王五

In [74]:
df[['name','age']]

  name  age
0   张三   17
1   赵六   18
2   王五   19

In [75]:
df

  name  age  height
0   张三   17    1.72
1   赵六   18    1.82
2   王五   19    1.65

In [76]:
df.name[1] = '李四'

c:\users\god\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [77]:
df

  name  age  height
0   张三   17    1.72
1   李四   18    1.82
2   王五   19    1.65

In [79]:
names = df.name.copy()

In [80]:
names

0    张三
1    李四
2    王五
Name: name, dtype: object

In [81]:
names[0] = 'jack'

In [82]:
names

0    jack
1      李四
2      王五
Name: name, dtype: object

In [83]:
df

  name  age  height
0   张三   17    1.72
1   李四   18    1.82
2   王五   19    1.65

In [84]:
df.columns[1:3]

Index(['age', 'height'], dtype='object')

In [85]:
df[df.columns[1:3]]

   age  height
0   17    1.72
1   18    1.82
2   19    1.65

In [87]:
import datetime

In [88]:
df['birthday'] = datetime.datetime.now().year - df.age

In [89]:
df

  name  age  height  birthday
0   张三   17    1.72      2002
1   李四   18    1.82      2001
2   王五   19    1.65      2000

In [91]:
df.drop('birthday',axis = 1)

  name  age  height
0   张三   17    1.72
1   李四   18    1.82
2   王五   19    1.65

In [92]:
df

  name  age  height  birthday
0   张三   17    1.72      2002
1   李四   18    1.82      2001
2   王五   19    1.65      2000

In [95]:
df.loc[[2]]

  name  age  height  birthday
2   王五   19    1.65      2000

In [96]:
df

  name  age  height  birthday
0   张三   17    1.72      2002
1   李四   18    1.82      2001
2   王五   19    1.65      2000

In [97]:
df2 = df.drop(1)

In [98]:
df2

  name  age  height  birthday
0   张三   17    1.72      2002
2   王五   19    1.65      2000

In [101]:
df2.iloc[1]

name          王五
age           19
height      1.65
birthday    2000
Name: 2, dtype: object

In [103]:
df2.index = range(df2.shape[0])

In [104]:
df2

  name  age  height  birthday
0   张三   17    1.72      2002
1   王五   19    1.65      2000

In [105]:
df

  name  age  height  birthday
0   张三   17    1.72      2002
1   李四   18    1.82      2001
2   王五   19    1.65      2000

In [106]:
df

  name  age  height  birthday
0   张三   17    1.72      2002
1   李四   18    1.82      2001
2   王五   19    1.65      2000

In [108]:
#query方法，进行筛选
df.query('age >= 18 and height<= 1.80')

  name  age  height  birthday
2   王五   19    1.65      2000

In [110]:
df.shape

(3, 4)

In [111]:
#范围筛选isin 
df['age'].isin([17,18])

0     True
1     True
2    False
Name: age, dtype: bool

In [112]:
df[df['age'].isin([17,18])]

  name  age  height  birthday
0   张三   17    1.72      2002
1   李四   18    1.82      2001

In [113]:
df.T

             0     1     2
name        张三    李四    王五
age         17    18    19
height    1.72  1.82  1.65
birthday  2002  2001  2000

In [114]:
df

  name  age  height  birthday
0   张三   17    1.72      2002
1   李四   18    1.82      2001
2   王五   19    1.65      2000